UB_Copy/src/InformationRegisters/УБ_УстановленныеШкалыПоказателей/УБ_УстановленныеШкалыПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_УстановленныеШкалыПоказателей</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ШкалаПоказателя</name>
    <type>
      <types>CatalogRef.УБ_ШкалыПоказателей</types>
    </type>
  </resources>
  <dimensions>
    <name>МодельПланирования</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВерсияГрейда</name>
    <type>
      <types>CatalogRef.УБ_ВерсииГрейдов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПоказателя</name>
    <type>
      <types>CatalogRef.УБ_ТипыПоказателей</types>
      <types>CatalogRef.УБ_ПоказателиЭффективности</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/InformationRegisters/УБ_УстановленныеШкалыПоказателей/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОтразитьШкалыПоказателей(ДанныеДокументаУтвержденияГрейда) Экспорт
	
	НаборЗаписей = РегистрыСведений.УБ_УстановленныеШкалыПоказателей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДанныеДокументаУтвержденияГрейда);
	
	Для каждого Строка из ДанныеДокументаУтвержденияГрейда.ТипыПоказателей Цикл
		Если Строка.ТипПоказателя.Матричный Тогда
			Запись = НаборЗаписей.Добавить();
			Запись.Период = ДанныеДокументаУтвержденияГрейда.Дата; 
			Запись.МодельПланирования = ДанныеДокументаУтвержденияГрейда.МодельПланированияЭффективности;
			Запись.Грейд = ДанныеДокументаУтвержденияГрейда.Грейд;
			Запись.ВерсияГрейда = ДанныеДокументаУтвержденияГрейда.ВерсияГрейда;
			Запись.ТипПоказателя = Строка.ТипПоказателя;
			Запись.ШкалаПоказателя = Строка.ШкалаПоказателя;
		КонецЕсли;	
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
